app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "kq9dHrzVJUf-diR4a6kl3w"], ["updated_at", "2022-08-18 13:01:32.385734"], ["id", 1]]